package com.ruyicai.charge.nineteenpay;

public enum NineteenpayCode {
	Y00000("00000", "支付成功"), 
	Y00001("00001", "支付成功。说明：用户选择面值与实际面值不符，实际面值大于订单金额。"), 	
	Y00003("00003", "支付成功。说明：用户选择面值与实际面值不符，实际面值小于用户选择金额。"),
	
	F00002("00002", "支付失败。您选择的充值卡面值与实际面值不符。原因：用户选择面值与实际面值不符，实际面值小于订单金额。"), 
	F10014("10014", "系统忙，请稍后再试。说明：金额格式异常。"),
	F10016("10016", "该订单支付已成功，不能重复提交。"),
	F10029("10029", "运营商系统维护，支付通道暂时关闭。"),
	F10030("10030", "运营商系统维护，该面值暂时关闭。"),
	F10076("10076", "该订单支付已失败，不能重复提交。"),
	F10082("10082", "该卡已被使用，请更换其他充值卡支付。说明：支付失败，该卡为失效卡，已锁卡。"),
	F10083("10083", "很抱歉！该卡已连续二次支付不成功，请更换其他充值卡支付。说明：失败次数过多，已经锁卡，如需重试可通过客服人工解锁。"),
	F10091("10091", "该卡正在处理中，请不要重复提交。"),
	F10110("10110", "系统忙，请稍后再试。说明：系统处理超时，请重新提交。"),
	F10119("10119", "充值卡面额选择错误。"),
	F10120("10120", "该订单正在处理中，不能重复提交。"),
	F10123("10123", "系统忙，请稍后再试。说明：输入参数有误。"),
	F10124("10124", "由于运营商系统临时维护，该省充值卡暂时无法支付，请稍后再试。说明：运营商系统临时维护，该省充值卡暂时无法支付，可继续提交，且不影响其它省充值卡支付。"),
	F81000("81000", "该卡已失效，请更换其他充值卡支付。说明：充值卡已失效。"),
	F81001("81001", "系统忙，请稍后再试。说明：运营商处理失败，该卡可再次提交。"),
	F81007("81007", "无效的卡号密码。"),
	F82009("82009", "系统忙，请稍后再试。说明：卡号密码加解密失败。"),
	F82019("82019", "本系统不支持该卡充值。说明：本系统不支持赠卡支付，如内蒙古运营商赠卡。");
	
	public String value;
	public String memo;

	NineteenpayCode(String value, String memo) {
		this.value = value;
		this.memo = memo;
	}
	
	public static String getMemo(String value) {
		NineteenpayCode[] nineteenpayCodes = values();
		for(NineteenpayCode nineteenpayCode : nineteenpayCodes) {
			if(nineteenpayCode.value.equals(value)) {
				return nineteenpayCode.memo;
			}
		}
		return "";
	}
}
