package com.ruyicai.charge.dna.common;


public enum DnapayCode {
    E0000("0000", "交易成功"),
    E0001("0001", "查发卡方，银联系统不支持的卡。建议：换卡、换支付方式"),
    E0002("0002", "查发卡方的特殊条件，银联系统不支持的卡。建议：换卡、换支付方式"),
    E0003("0003", "无效商户，商户没有在银联或银联登记。建议：换卡、换支付方式"),
    E0004("0004", "没收卡，银联系统不支持的卡。建议：换卡、换支付方式"),
    E0005("0005", "不予承兑，银联系统不支持的卡"),
    E0006("0006", "银联系统错误。建议：重试、换卡、换支付方式"),
    E0007("0007", "特殊条件下没收卡，银联系统不支持的卡。建议：换卡、换支付方式"),
    E0009("0009", "请求正在处理中。建议：重试、换卡、换支付方式"),
    E0010("0010", "银联系统错误，或银联系统不支持的卡。建议：重试、换卡、换支付方式"),
    E0012("0012", "无效交易，银联系统不支持的交易。建议：换卡、换支付方式"),
    E0013("0013", "无效金额，银联系统不支持的交易金额。建议：换卡、换支付方式"),
    E0014("0014", "无效卡号，银联系统不支持的卡。建议：换卡、换支付方式"),
    E0015("0015", "无此发卡方，银联系统不支持的卡。建议：换卡、换支付方式"),
    E0019("0019", "重新送入交易。建议：换卡、换支付方式"),
    E0020("0020", "无效应答，银联系统交易失败。建议：换卡、换支付方式"),
    E0021("0021", "不作任何处理，银联系统交易失败。建议：换卡、换支付方式"),
    E0022("0022", "怀疑操作有误，银联系统处理失败。建议：换卡、换支付方式"),
    E0023("0023", "银联不可接受的交易费。建议：换卡、换支付方式"),
    E0025("0025", "银联未能找到文件上记录；银联系统您请求的原交易，退款，冲正的时候会发生。建议：联系银联手机支付客服"),
    E0030("0030", "格式错误，银联系统处理失败。建议：重试、换卡、换支付方式"),
    E0031("0031", "银联交换中心不支持的银联。建议：换卡、换支付方式"),
    E0033("0033", "银联没收卡，过期的卡。建议：换卡、换支付方式"),
    E0034("0034", "银联没收卡，有作弊嫌疑。建议：换卡、换支付方式"),
    E0035("0035", "银联没收卡，受卡方与安全保密部门联系。建议：换卡、换支付方式"),
    E0036("0036", "银联没收卡，受限制的卡。建议：换卡、换支付方式"),
    E0037("0037", "银联没收卡，受卡方呼受理方安全保密部门。建议：换卡、换支付方式"),
    E0038("0038", "银联没收卡，超过允许的密码试输入。建议：换卡、换支付方式"),
    E0039("0039", "银联无此信用卡账户。建议：换卡、换支付方式"),
    E0040("0040", "请求的功能银联尚不支持。建议：换卡、换支付方式"),
    E0041("0041", "银联挂失卡。建议：换卡、换支付方式"),
    E0042("0042", "银联无此账户。建议：换卡、换支付方式"),
    E0043("0043", "银联没收卡，被窃卡。建议：换卡、换支付方式"),
    E0044("0044", "银联无此投资账户。建议：换卡、换支付方式"),
    E0051("0051", "银联卡无足够的存款。建议：存钱、重试、换卡、换支付方式"),
    E0052("0052", "银联无此支票账户。建议：换卡、换支付方式"),
    E0053("0053", "银联无此储蓄卡账户。建议：换卡、换支付方式"),
    E0054("0054", "银联过期的卡。建议：换卡、换支付方式"),
    E0055("0055", "银联卡不正确的密码。建议：重试、换卡、换支付方式"),
    E0056("0056", "银联无此卡记录。建议：换卡、换支付方式"),
    E0057("0057", "银联不允许持卡人进行的交易。建议：换卡、换支付方式"),
    E0058("0058", "银联不允许终端进行的交易。建议：换卡、换支付方式"),
    E0059("0059", "有作弊嫌疑的交易。建议：换卡、换支付方式"),
    
     	
	E00003("00003", "。");
	
	public String value;
	public String memo;

	DnapayCode(String value, String memo) {
		this.value = value;
		this.memo = memo;
	}
	
	public static String getMemo(String value) {
		DnapayCode[] dnapayCodes = values();
		for(DnapayCode dnapayCode : dnapayCodes) {
			if(dnapayCode.value.equals(value)) {
				return dnapayCode.memo;
			}
		}
		return "";
	}
}
